In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./data/Iris.csv')

In [3]:
print(df.head())

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [4]:
print(df.tail())

      Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm  \
145  146            6.7           3.0            5.2           2.3
146  147            6.3           2.5            5.0           1.9
147  148            6.5           3.0            5.2           2.0
148  149            6.2           3.4            5.4           2.3
149  150            5.9           3.0            5.1           1.8

            Species
145  Iris-virginica
146  Iris-virginica
147  Iris-virginica
148  Iris-virginica
149  Iris-virginica

In [5]:
print(df.columns)

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [6]:
print(df.index)

RangeIndex(start=0, stop=150, step=1)

In [7]:
df = df.rename(columns = {"May 1"})
print(df.columns)

TypeError: 'set' object is not callable

In [ ]:
# select the column "Sepal Length" 
# way 1
print(df['SepalLengthCm'])
#way2
print(df.SepalLengthCm)

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: SepalLengthCm, Length: 150, dtype: float64
0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: SepalLengthCm, Length: 150, dtype: float64

In [ ]:
# select the column "Sepal Length"  and "Sepal width" 
df[['SepalLengthCm', 'SepalWidthCm']]

     SepalLengthCm  SepalWidthCm
0              5.1           3.5
1              4.9           3.0
2              4.7           3.2
3              4.6           3.1
4              5.0           3.6
..             ...           ...
145            6.7           3.0
146            6.3           2.5
147            6.5           3.0
148            6.2           3.4
149            5.9           3.0

[150 rows x 2 columns]

In [15]:
df = pd.DataFrame([['Tom',15,'Male','middle'],['Alice',10, 'Female','elementary']], columns =['Name','Age','gender','School'])

In [16]:
df

    Name  Age  gender      School
0    Tom   15    Male      middle
1  Alice   10  Female  elementary

In [ ]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [22]:
# change the index 
df.index = ['student1','student2']
df

             Name  Age  gender      School
studddent1    Tom   15    Male      middle
student2    Alice   10  Female  elementary

In [23]:
# way 2
df = df.rename(index = {0:'student1',1:'student2'})
# check the index
df.index

Index(['studddent1', 'student2'], dtype='object')

In [ ]:
# way 3


# check the index

       Age  gender      School
Name
Tom     15    Male      middle
Alice   10  Female  elementary

In [25]:
exam_data = {
    "math":[90,80,70],
    "eng":[98,89,95],
    "music":[85,95,100],
    "science":[100,90,90]
}

In [27]:
# transform into dataFrame(index :stud1, stud2, stud3)
df = pd.DataFrame(exam_data, index = ['stud1', 'stud2', 'stud3'])
df

       math  eng  music  science
stud1    90   98     85      100
stud2    80   89     95       90
stud3    70   95    100       90

In [31]:
# make three copy (df1,df2,df3, df4)
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()

In [32]:
#drop stud2 from df1
df1 = df1.drop('stud2')
df1

       math  eng  music  science
stud1    90   98     85      100
stud3    70   95    100       90

In [33]:
#drop stud2 and stud3 from df2
df2 = df2.drop(['stud2','stud3'])
df2

       math  eng  music  science
stud1    90   98     85      100

In [34]:
#drop the columns 'music' from df3
df3 = df3.drop('music', axis = 1)
df3

       math  eng  science
stud1    90   98      100
stud2    80   89       90
stud3    70   95       90

In [35]:
#drop the columns 'music'  and science from df4
df4 = df4.drop(['music','science'], axis = 1)
df4

       math  eng
stud1    90   98
stud2    80   89
stud3    70   95

# indexing and slicing

In [36]:
# select the first row using 'iloc'
df.iloc[0]

math        90
eng         98
music       85
science    100
Name: stud1, dtype: int64

In [37]:
# select the first row using 'loc'
df.loc['stud1']

math        90
eng         98
music       85
science    100
Name: stud1, dtype: int64

In [38]:
# select the first row using 'loc'
df.loc['stud1']

math        90
eng         98
music       85
science    100
Name: stud1, dtype: int64

In [39]:
# select the 'stud1' and 'stud2' using iloc
df.iloc[[0,1]]

       math  eng  music  science
stud1    90   98     85      100
stud2    80   89     95       90

In [40]:
# select the 'stud1' and 'stud2' using loc
df.loc[['stud1','stud2']]

       math  eng  music  science
stud1    90   98     85      100
stud2    80   89     95       90

In [41]:
exam_data = {
    "name":['hongildong','hongeeedong','hongsamdong'],
    "math":[90,80,70],
    "eng":[98,89,95],
    "music":[85,95,100],
    "science":[100,90,90]
}

In [43]:
# transform into dataFrame
df = pd.DataFrame(exam_data)
df

          name  math  eng  music  science
0   hongildong    90   98     85      100
1  hongeeedong    80   89     95       90
2  hongsamdong    70   95    100       90

In [44]:
# set the column "name" as the new index
df.index = df['name']
df

                    name  math  eng  music  science
name
hongildong    hongildong    90   98     85      100
hongeeedong  hongeeedong    80   89     95       90
hongsamdong  hongsamdong    70   95    100       90

In [46]:
# select music score of hongildong
print(df.loc['hongildong','music'])
print(df.iloc[0,3])

85
85

In [47]:
# select music and science score of hongildong
#using iloc 
#using loc
print(df.loc['hongildong',['music','science']])
print(df.iloc[0,[3,4]])

music       85
science    100
Name: hongildong, dtype: object
music       85
science    100
Name: hongildong, dtype: object

In [48]:
# ### slicing
#select math, eng, music, and science score of hongeeedong
#using iloc 
df.iloc[1,1:]

math       80
eng        89
music      95
science    90
Name: hongeeedong, dtype: object

In [49]:
#using loc
df.loc['hongeeedong',['math','eng','music','science']]

math       80
eng        89
music      95
science    90
Name: hongeeedong, dtype: object

In [50]:
#select math, eng, music, and science score of hongeeedong and hongildong
#using iloc 
df.iloc[[0,1],1:]

             math  eng  music  science
name
hongildong     90   98     85      100
hongeeedong    80   89     95       90

In [51]:
#using loc
df.loc[['hongeeedong','hongildong'],['math','eng','music','science']]

             math  eng  music  science
name
hongeeedong    80   89     95       90
hongildong     90   98     85      100

In [53]:
# add a new column physics with the score 80
df['physics'] = 80
df

                    name  math  eng  music  science  physics
name
hongildong    hongildong    90   98     85      100       80
hongeeedong  hongeeedong    80   89     95       90       80
hongsamdong  hongsamdong    70   95    100       90       80

In [54]:
# add a new row
df.loc['mahdi'] = ['mahdi', 100, 100, 100, 100, 100]

In [55]:
df

                    name  math  eng  music  science  physics
name
hongildong    hongildong    90   98     85      100       80
hongeeedong  hongeeedong    80   89     95       90       80
hongsamdong  hongsamdong    70   95    100       90       80
mahdi              mahdi   100  100    100      100      100